coocox/Mplib/Toshaba/TMPM36x/TMPM362/cmsis_lib/lib/source/tmpm362_cec.c
/**
  * @brief Specify waveform error detection range
  * @param  Logical1RisingTimeMin: The fastest rising timing of logical "1" determined as proper
  *   This parameter can be:
  *   CEC_LOGICAL_1_RISING_TIME_MIN_0,CEC_LOGICAL_1_RISING_TIME_MIN_1,CEC_LOGICAL_1_RISING_TIME_MIN_2,
  *   CEC_LOGICAL_1_RISING_TIME_MIN_3,CEC_LOGICAL_1_RISING_TIME_MIN_4,CEC_LOGICAL_1_RISING_TIME_MIN_5,
  *   CEC_LOGICAL_1_RISING_TIME_MIN_6 or CEC_LOGICAL_1_RISING_TIME_MIN_7
  * @param  Logical1RisingTimeMax: The latest rising timing of logical "1" determined as proper waveform
  *   This parameter can be:
  *   CEC_LOGICAL_1_RISING_TIME_MAX_0,CEC_LOGICAL_1_RISING_TIME_MAX_1,CEC_LOGICAL_1_RISING_TIME_MAX_2,
  *   CEC_LOGICAL_1_RISING_TIME_MAX_3,CEC_LOGICAL_1_RISING_TIME_MAX_4,CEC_LOGICAL_1_RISING_TIME_MAX_5,
  *   CEC_LOGICAL_1_RISING_TIME_MAX_6 or CEC_LOGICAL_1_RISING_TIME_MAX_7
  * @param  Logical0RisingTimeMin: The fastest rising timing of logical "0" determined as proper
  *   This parameter can be:
  *   CEC_LOGICAL_0_RISING_TIME_MIN_0,CEC_LOGICAL_0_RISING_TIME_MIN_1,CEC_LOGICAL_0_RISING_TIME_MIN_2,
  *   CEC_LOGICAL_0_RISING_TIME_MIN_3,CEC_LOGICAL_0_RISING_TIME_MIN_4,CEC_LOGICAL_0_RISING_TIME_MIN_5,
  *   CEC_LOGICAL_0_RISING_TIME_MIN_6 or CEC_LOGICAL_0_RISING_TIME_MIN_7
  * @param  Logical0RisingTimeMax: The latest rising timing of logical "0" determined as proper waveform
  *   This parameter can be:
  *   CEC_LOGICAL_0_RISING_TIME_MAX_0,CEC_LOGICAL_0_RISING_TIME_MAX_1,CEC_LOGICAL_0_RISING_TIME_MAX_2,
  *   CEC_LOGICAL_0_RISING_TIME_MAX_3,CEC_LOGICAL_0_RISING_TIME_MAX_4,CEC_LOGICAL_0_RISING_TIME_MAX_5,
  *   CEC_LOGICAL_0_RISING_TIME_MAX_6 or CEC_LOGICAL_0_RISING_TIME_MAX_7
  * @retval The value returned can be one of the following values:
  *   SUCCESS or ERROR
  */
Result CEC_SetRxDetectWaveConfig(CEC_Logical1RisingTimeMin Logical1RisingTimeMin,
                                 CEC_Logical1RisingTimeMax Logical1RisingTimeMax,
                                 CEC_Logical0RisingTimeMin Logical0RisingTimeMin,
                                 CEC_Logical0RisingTimeMax Logical0RisingTimeMax)
{
    Result retval = ERROR;
    uint32_t tmp = 0U;
    assert_param(IS_LOGICAL_1_RISING_TIME_MIN(Logical1RisingTimeMin));
    assert_param(IS_LOGICAL_1_RISING_TIME_MAX(Logical1RisingTimeMax));
    assert_param(IS_LOGICAL_0_RISING_TIME_MIN(Logical0RisingTimeMin));
    assert_param(IS_LOGICAL_0_RISING_TIME_MAX(Logical0RisingTimeMax));
    if (CEC_GetTxState() == DONE) {
        if (CEC_GetRxState() == DISABLE) {
            tmp = TSB_CEC->RCR3 & CEC_RX_WAVE_ERR_MASK;
            tmp |= ((uint32_t) Logical1RisingTimeMin) << 8U;
            tmp |= ((uint32_t) Logical1RisingTimeMax) << 12U;
            tmp |= ((uint32_t) Logical0RisingTimeMin) << 16U;
            tmp |= ((uint32_t) Logical0RisingTimeMax) << 20U;
            /*Set Rx Detect Wave configuration register */
            TSB_CEC->RCR3 = tmp;
            retval = SUCCESS;
        }
    }
    return retval;
}

/**
  * @brief Specify the cycles to detect a start bit and the rising timing of a start bit in its detection
  * @param  RisingTimeMin: Min. time of start bit rising timing
  *   This parameter can be:
  *   CEC_START_BIT_RISING_TIME_MIN_0,CEC_START_BIT_RISING_TIME_MIN_1,CEC_START_BIT_RISING_TIME_MIN_2,
  *   CEC_START_BIT_RISING_TIME_MIN_3,CEC_START_BIT_RISING_TIME_MIN_4,CEC_START_BIT_RISING_TIME_MIN_5,
  *   CEC_START_BIT_RISING_TIME_MIN_6 or CEC_START_BIT_RISING_TIME_MIN_7
  * @param  RisingTimeMax: Max. time of start bit rising timing
  *   This parameter can be:
  *   CEC_START_BIT_RISING_TIME_MAX_0,CEC_START_BIT_RISING_TIME_MAX_1,CEC_START_BIT_RISING_TIME_MAX_2,
  *   CEC_START_BIT_RISING_TIME_MAX_3,CEC_START_BIT_RISING_TIME_MAX_4,CEC_START_BIT_RISING_TIME_MAX_5,
  *   CEC_START_BIT_RISING_TIME_MAX_6 or CEC_START_BIT_RISING_TIME_MAX_7
  * @param  CycleMin: Min. cycle to detect start bit
  *   This parameter can be:
  *   CEC_START_BIT_CYCLE_MIN_0,CEC_START_BIT_CYCLE_MIN_1,CEC_START_BIT_CYCLE_MIN_2,
  *   CEC_START_BIT_CYCLE_MIN_3,CEC_START_BIT_CYCLE_MIN_4,CEC_START_BIT_CYCLE_MIN_5,
  *   CEC_START_BIT_CYCLE_MIN_6 or CEC_START_BIT_CYCLE_MIN_7
  * @param  CycleMax: Max. cycle to detect start bit
  *   This parameter can be:
  *   CEC_START_BIT_CYCLE_MAX_0,CEC_START_BIT_CYCLE_MAX_1,CEC_START_BIT_CYCLE_MAX_2,
  *   CEC_START_BIT_CYCLE_MAX_3,CEC_START_BIT_CYCLE_MAX_4,CEC_START_BIT_CYCLE_MAX_5,
  *   CEC_START_BIT_CYCLE_MAX_6 or CEC_START_BIT_CYCLE_MAX_7
  * @retval The value returned can be one of the following values:
  *   SUCCESS or ERROR
  */
Result CEC_SetRxStartBitWaveConfig(CEC_StartBitRisingTimeMin RisingTimeMin,
                                   CEC_StartBitRisingTimeMax RisingTimeMax,
                                   CEC_StartBitCycleMin CycleMin, CEC_StartBitCycleMax CycleMax)
{
    Result retval = ERROR;
    uint32_t tmp = 0U;
    assert_param(IS_CEC_START_BIT_RISING_TIME_MIN(RisingTimeMin));
    assert_param(IS_CEC_START_BIT_RISING_TIME_MAX(RisingTimeMax));
    assert_param(IS_CEC_START_BIT_CYCLE_MIN(CycleMin));
    assert_param(IS_CEC_START_BIT_CYCLE_MAX(CycleMax));
    if (CEC_GetTxState() == DONE) {
        if (CEC_GetRxState() == DISABLE) {
            tmp = TSB_CEC->RCR2 & CEC_RX_START_BIT_WAVE_MASK;
            tmp |= (uint32_t) RisingTimeMin;
            tmp |= ((uint32_t) RisingTimeMax) << 4U;
            tmp |= ((uint32_t) CycleMin) << 8U;
            tmp |= ((uint32_t) CycleMax) << 12U;
            /*Set Rx Detect Wave configuration register */
            TSB_CEC->RCR2 = tmp;
            retval = SUCCESS;
        }
    }
    return retval;
}

/**
  * @brief Enable or disable the function that detects a received waveform
  *   does not identical to the one defined and generates waveform error interrupt
  * @param  NewState: The state of Waveform error detection Mode
  *   This parameter can be: ENABLE or DISABLE.
  * @retval The value returned can be one of the following values:
  *   SUCCESS or ERROR
  */
Result CEC_SetRxWaveErrDetect(FunctionalState NewState)
{
    Result retval = ERROR;
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    if (CEC_GetTxState() == DONE) {
        if (CEC_GetRxState() == DISABLE) {
            if (NewState == ENABLE) {
                /*Enable Rx Wave Err Detect */
                TSB_CEC_RCR3_CECWAVEN = 1U;
            } else {
                /*Disable Rx Wave Err Detect */
                TSB_CEC_RCR3_CECWAVEN = 0U;
            }
            retval = SUCCESS;
        }
    }
    return retval;
}

/**
  * @brief Specify the waveform parameter for transmit
  * @param  DataBitCycle: the cycle of a data bit
  *   This parameter can be:
  *   CEC_TX_DATA_BIT_CYCLE_0,CEC_TX_DATA_BIT_CYCLE_1,CEC_TX_DATA_BIT_CYCLE_2,CEC_TX_DATA_BIT_CYCLE_3,
  *   CEC_TX_DATA_BIT_CYCLE_4,CEC_TX_DATA_BIT_CYCLE_5,CEC_TX_DATA_BIT_CYCLE_6,CEC_TX_DATA_BIT_CYCLE_7,
  *   CEC_TX_DATA_BIT_CYCLE_8,CEC_TX_DATA_BIT_CYCLE_9,CEC_TX_DATA_BIT_CYCLE_10,CEC_TX_DATA_BIT_CYCLE_11,
  *   CEC_TX_DATA_BIT_CYCLE_12,CEC_TX_DATA_BIT_CYCLE_13,CEC_TX_DATA_BIT_CYCLE_14 or CEC_TX_DATA_BIT_CYCLE_15
  * @param  DataBitRisingTime: The rising timing of a data bit.
  *   This parameter can be:
  *   CEC_TX_DATA_BIT_RISING_TIME_0,CEC_TX_DATA_BIT_RISING_TIME_1,CEC_TX_DATA_BIT_RISING_TIME_2,
  *   CEC_TX_DATA_BIT_RISING_TIME_3,CEC_TX_DATA_BIT_RISING_TIME_4,CEC_TX_DATA_BIT_RISING_TIME_5,
  *   CEC_TX_DATA_BIT_RISING_TIME_6 or CEC_TX_DATA_BIT_RISING_TIME_7
  * @param  StartBitCycle: the cycle of a start bit.
  *   This parameter can be:
  *   CEC_TX_START_BIT_CYCLE_0,CEC_TX_START_BIT_CYCLE_1,CEC_TX_START_BIT_CYCLE_2,
  *   CEC_TX_START_BIT_CYCLE_3,CEC_TX_START_BIT_CYCLE_4,CEC_TX_START_BIT_CYCLE_5,
  *   CEC_TX_START_BIT_CYCLE_6 or CEC_TX_START_BIT_CYCLE_7
  * @param  StartBitRisingTime: the rising timing of a start bit.
  *   This parameter can be:
  *   CEC_TX_START_BIT_RISING_TIME_0,CEC_TX_START_BIT_RISING_TIME_1,CEC_TX_START_BIT_RISING_TIME_2,
  *   CEC_TX_START_BIT_RISING_TIME_3,CEC_TX_START_BIT_RISING_TIME_4,CEC_TX_START_BIT_RISING_TIME_5,
  *   CEC_TX_START_BIT_RISING_TIME_6 or CEC_TX_START_BIT_RISING_TIME_7
  * @retval The value returned can be one of the following values:
  *   SUCCESS or ERROR
  */
Result CEC_SetTxWaveConfig(CEC_TxDataBitCycle DataBitCycle,
                           CEC_TxDataBitRisingTime DataBitRisingTime,
                           CEC_TxStartBitCycle StartBitCycle,
                           CEC_TxStartBitRisingTime StartBitRisingTime)
{
    Result retval = ERROR;
    uint32_t tmp = 0U;
    assert_param(IS_CEC_TX_DATA_BIT_CYCLE(DataBitCycle));
    assert_param(IS_CEC_TX_DATA_BIT_RISING_TIME(DataBitRisingTime));
    assert_param(IS_CEC_TX_START_BIT_CYCLE(StartBitCycle));
    assert_param(IS_CEC_TX_START_BIT_RISING_TIME(StartBitRisingTime));
    if (CEC_GetTxState() == DONE) {
        tmp = TSB_CEC->TCR & CEC_TX_WAVE_MASK;
        tmp |= ((uint32_t) DataBitCycle) << 8U;
        tmp |= ((uint32_t) DataBitRisingTime) << 12U;
        tmp |= ((uint32_t) StartBitCycle) << 16U;
        tmp |= ((uint32_t) StartBitRisingTime) << 20U;
        /*Set Tx Wave configuration register */
        TSB_CEC->TCR = tmp;
        retval = SUCCESS;
    }
    return retval;
}

/**
  * @brief Set message as a broadcast message or not
  * @param  NewState: The state of Waveform error detection Mode
  *   This parameter can be: ENABLE or DISABLE.
  * @retval The value returned can be one of the following values:
  *   SUCCESS or ERROR
  */
Result CEC_SetTxBroadcast(FunctionalState NewState)
{
    Result retval = ERROR;
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    if (CEC_GetTxState() == DONE) {
        if (NewState == ENABLE) {
            /*Set Broadcaset Mode */
            TSB_CEC_TCR_CECBRD = 1U;
        } else {
            /*Set NoBroadcaset Mode */
            TSB_CEC_TCR_CECBRD = 0U;
        }
        retval = SUCCESS;
    }
    return retval;
}

/**
  * @brief Specify time of a bus to be free that checked before transmission
  * @param  BusFree: the cycle of a data bit
  *   This parameter can be:
  *   CEC_BUS_FREE_1_BIT,CEC_BUS_FREE_2_BIT,CEC_BUS_FREE_3_BIT,CEC_BUS_FREE_4_BIT
  *   CEC_BUS_FREE_5_BIT,CEC_BUS_FREE_6_BIT,CEC_BUS_FREE_7_BIT,CEC_BUS_FREE_8_BIT,
  *   CEC_BUS_FREE_9_BIT,CEC_BUS_FREE_10_BIT,CEC_BUS_FREE_11_BIT,CEC_BUS_FREE_12_BIT,
  *   CEC_BUS_FREE_13_BIT,CEC_BUS_FREE_14_BIT,CEC_BUS_FREE_15_BIT or CEC_BUS_FREE_16_BIT
  * @retval The value returned can be one of the following values:
  *   SUCCESS or ERROR
  */
Result CEC_SetBusFreeTime(CEC_BusFree BusFree)
{
    Result retval = ERROR;
    uint32_t tmp = 0U;
    assert_param(IS_CEC_BUS_FREE(BusFree));
    if (CEC_GetTxState() == DONE) {
        tmp = TSB_CEC->TCR & CEC_BUS_FREE_MASK;
        tmp |= (uint32_t) BusFree;
        /*Set BusFreeTime register */
        TSB_CEC->TCR = tmp;
        retval = SUCCESS;
    }
    return retval;
}

/**
  * @brief Specify the sampling clock for CEC function
  * @param  ClkSrc: the sampling clock Source
  *   This parameter can be:
  *   CEC_CLK_SRC_32KHZ or CEC_CLK_SRC_TBAOUT
  * @retval None
  */
void CEC_SetSrcClk(CEC_SrcClk ClkSrc)
{
    assert_param(IS_CEC_CLK_SRC(ClkSrc));
    if (ClkSrc == CEC_CLK_SRC_32KHZ) {
        TSB_CEC_FSSEL_CECCLK = 0U;
    } else {
        TSB_CEC_FSSEL_CECCLK = 1U;
    }
}

/** @} */
/* End of group CEC_Exported_Functions */

/** @} */
/* End of group CEC */

/** @} */
/* End of group TX03_Periph_Driver */
#endif                          /* defined(__TMPM360_CEC_H) || defined(__TMPM361_CEC_H) || \*/
                                /* defined(__TMPM362_CEC_H) || defined(__TMPM363_CEC_H) || \*/
                                /* defined(__TMPM364_CEC_H) */
